In [1]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'col1': np.random.randint(0, 10, 3),
                    'col2': np.random.randint(30, 40, 3)})
df2 = pd.DataFrame({'col1': np.random.randint(10, 20, 3),
                    'col2': np.random.randint(20,30, 3)})

print(df1)
print(df2)

   col1  col2
0     6    39
1     7    39
2     8    39
   col1  col2
0    12    25
1    19    22
2    13    23

In [2]:
df1.combine(df2, np.maximum)

   col1  col2
0    12    39
1    19    39
2    13    39

In [3]:
def get_greater_equals(v1, v2):
    return v1 if v1.sum() >= v2.sum() else v2

df1.combine(df2, get_greater_equals)

   col1  col2
0    12    39
1    19    39
2    13    39

## fill_value인자

In [4]:
import pandas as pd
import numpy as np


df1 = pd.DataFrame({'col1': np.random.randint(0, 10, 3),
                    'col2': np.random.randint(30, 40, 3)})
df2 = pd.DataFrame({'col1': np.random.randint(10, 20, 3),
                    'col2': np.array([21, np.nan, np.nan])})

print(df1)
print(df2)

   col1  col2
0     5    39
1     5    36
2     4    36
   col1  col2
0    19  21.0
1    19   NaN
2    11   NaN

In [5]:
df1.combine(df2, np.minimum, fill_value=-10)

   col1  col2
0     5  21.0
1     5 -10.0
2     4 -10.0

In [6]:
def get_less_equals(v1, v2):
    return v1 if v1.sum() <= v2.sum() else v2

df1.combine(df2, get_less_equals, fill_value=-10)

   col1  col2
0     5  21.0
1     5 -10.0
2     4 -10.0

## overWrite인자

In [12]:
pd.set_option('display.notebook_repr_html', False)

df1 = pd.DataFrame({'col1': np.array([1, 2, 3]), 'col3': np.array([31,32,33])})
df3 = pd.DataFrame({'col1': np.array([11, 12, 13]) })
df1

   col1  col3
0     1    31
1     2    32
2     3    33

In [13]:
df3

   col1
0    11
1    12
2    13

In [14]:
#overWrite=True이면, self 열이 other에 없는 경우, NaN으로 대체함
print(df1.combine(df3, np.maximum,overwrite=True))

   col1  col3
0    11   NaN
1    12   NaN
2    13   NaN

In [15]:
#overWrite=False이면 존재하지 않는 열 값을 을 NaN으로 대체함
print(df1.combine(df3, np.maximum,overwrite=False))

   col1  col3
0    11    31
1    12    32
2    13    33